# IS 362 – Project 3: Exploring the Chinook Database

### Introduction
##### The Chinook database is a sample database, representing a digital media store, including tables for artists, albums, media tracks, invoices, and customers. This project aims to combine information from various tables in the Chinook database and display specific data using pandas in Python.

In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect("C:\\Users\\Victor Pessoa\\Desktop\\IS 362 – Project 3\\Chinook_Sqlite.sqlite")

In [4]:
sql_query = """
SELECT c.LastName, c.FirstName, t.Name AS TrackName, a.Title AS AlbumTitle
FROM Customer c
JOIN Invoice i ON c.CustomerId = i.CustomerId
JOIN InvoiceLine il ON i.InvoiceId = il.InvoiceId
JOIN Track t ON il.TrackId = t.TrackId
JOIN Album a ON t.AlbumId = a.AlbumId
ORDER BY c.LastName, c.FirstName
"""

df_chinook = pd.read_sql(sql_query, conn)

In [5]:
df_chinook.head()

,LastName,FirstName,TrackName,AlbumTitle
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas

### Conclusion
##### In this project, we successfully combined data from multiple tables in the Chinook database to display a list of customers and their respective purchased tracks and albums. The data provides insights into customer preferences and the popularity of various tracks and albums in the digital media store.